//获取地图坐标点
export async function getChinaGeoCoordMap(_that,data) {
    let chinaGeoCoordMap = {
        '黑龙江': [127.9688, 45.368],
        '内蒙古': [110.3467, 41.4899],
        "吉林": [125.8154, 44.2584],
        '北京': [116.4551, 40.2539],
        "辽宁": [123.1238, 42.1216],
        "河北": [114.4995, 38.1006],
        "天津": [117.4219, 39.4189],
        "山西": [112.3352, 37.9413],
        "陕西": [109.1162, 34.2004],
        "甘肃": [103.5901, 36.3043],
        "宁夏": [106.3586, 38.1775],
        "青海": [101.4038, 36.8207],
        "新疆": [87.9236, 43.5883],
        "西藏": [91.11, 29.97],
        "四川": [103.9526, 30.7617],
        "重庆": [108.384366, 30.439702],
        "山东": [117.1582, 36.8701],
        "河南": [113.4668, 34.6234],
        "江苏": [118.8062, 31.9208],
        "安徽": [117.29, 32.0581],
        "湖北": [114.3896, 30.6628],
        "浙江": [119.5313, 29.8773],
        "福建": [119.4543, 25.9222],
        "江西": [116.0046, 28.6633],
        "湖南": [113.0823, 28.2568],
        "贵州": [106.6992, 26.7682],
        "云南": [102.9199, 25.4663],
        "广东": [113.12244, 23.009505],
        "广西": [108.479, 23.1152],
        "海南": [110.3893, 19.8516],
        '上海': [121.4648, 31.2891],
    };
    _that.chinaGeoCoord  = chinaGeoCoordMap;
    data.forEach((item,index)=>{
        let location = new Array();
            location.push(parseInt(item.lgn));
        location.push(parseInt(item.lat));
        _that.chinaGeoCoord[item.name]=location;
   })
}
//获取监测中心对应的管理区域
export async function getManaAreaData(_that,data) {
    let  proviceData = {
        '110000':	'北京',
        '120000':	'天津',
        '130000':	'河北',
        '140000':	'山西',
        '150000':	'内蒙古',
        '210000':	'辽宁',
        '220000':	'吉林',
        '230000':	'黑龙江',
        '310000':	'上海',
        '320000':	'江苏',
        '330000':	'浙江',
        '340000':	'安徽',
        '350000':	'福建',
        '360000':	'江西',
        '370000':	'山东',
        '410000':	'河南',
        '420000':	'湖北',
        '430000':	'湖南',
        '440000':	'广东',
        '450000':	'广西',
        '460000':	'海南',
        '500000':	'重庆',
        '510000':	'四川',
        '520000':	'贵州',
        '530000':	'云南',
        '540000':	'西藏',
        '610000':	'陕西',
        '620000':	'甘肃',
        '630000':	'青海',
        '640000':	'宁夏',
        '650000':	'新疆',
        '710000':	'台湾',
        '810000':	'香港',
        '820000':	'澳门',
    }
    let chinaDatas = [
        // [{
        //     name: '黑龙江',
        //     value: 0
        // }],	[{
        //     name: '内蒙古',
        //     value: 0
        // }],	[{
        //     name: '吉林',
        //     value: 0
        // }],	[{
        //     name: '辽宁',
        //     value: 0
        // }]
    ];
    data.forEach((item,index)=>{
        let ids = item.id.split(",");
        let  array = [];
        for(let i=0;i<ids.length;i++){ 
            let chinaData = [];
            let name =  proviceData[ids[i]];
            let object = {"name":name,"value":0};
            chinaData.push(object);
            array.push(chinaData);
        }
        chinaDatas[item.name]=array;
   })
   _that.chinaDatas = chinaDatas ;
}